zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MIMXRT735S/drivers/romapi/nboot/fsl_romapi_nboot.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef NBOOT_API_H_
#define NBOOT_API_H_

#include <stdlib.h>
#include <stdint.h>
#include "fsl_common.h"

/*******************************************************************************
 * Definitions
 *******************************************************************************/
#define NBOOT_ROOT_CERT_COUNT                                  (4u)
#define NXPCLSB3_DIGEST_LENGTH_SHA256                          (32u)
#define NXPCLSB3_DIGEST_LENGTH_SHA384                          (48u)
#define NXPCLSB3_MAX_DIGEST_LENGTH                             (48u)
#define NBOOT_CONTEXT_RUNTIME_FINGERPRINT_BYTELEN              (32u)
#define NBOOT_CONTEXT_CRYPTOLIB_MULTIPART_CMAC_CONTEXT_BYTELEN (256u)
#define NBOOT_CONTEXT_GDET_CONF_BUFFER_BYTELEN                 (16u)
#define NBOOT_CONTEXT_CRYPTOLIB_MULTIPART_DRBG_CONTEXT_BYTELEN (544u)
#define NBOOT_GET_WORDLEN_FROM_BYTELEN(bytelen)                ((bytelen + 3) / sizeof(uint32_t))
#define NBOOT_KEYINFO_WORDLEN                                  (23u)
#define NXPCLHASH_WA_SIZE_MAX                                  (128u + 64u)
#define NBOOT_CONTEXT_BYTELEN                                  (192u + NXPCLHASH_WA_SIZE_MAX)
#define NBOOT_CONTEXT_WORDLEN                                  (NBOOT_CONTEXT_BYTELEN / sizeof(uint32_t))
#define NXPCLCSS_HASH_RTF_OUTPUT_SIZE                          ((size_t)32U) ///< Size of RTF appendix to hash output buffer, in bytes

#define NBOOT_EC_COORDINATE_256_SIZE_IN_BYTES (32u)
#define NBOOT_EC_COORDINATE_384_SIZE_IN_BYTES (48u)
#define NBOOT_EC_COORDINATE_521_SIZE_IN_BYTES (66u)

#define NBOOT_EC_COORDINATE_MAX_SIZE         NBOOT_EC_COORDINATE_384_SIZE_IN_BYTES
#define NBOOT_EC_MIN_SIGNATURE_SIZE_IN_BYTES (2u * NBOOT_EC_COORDINATE_256_SIZE_IN_BYTES)

#define NBOOT_ROOT_OF_TRUST_HASH_SIZE_IN_BYTES (48u)

/* SB3.1 */
#define NBOOT_SB3_MANIFEST_MAX_LENGTH_IN_BYTES \
    ((712u) + NBOOT_ISK_USER_DATA_MAX_SIZE_IN_BYTES) /* 712 + user data size */
#define NBOOT_SB3_MANIFEST_MIN_LENGTH_IN_BYTES \
    (236u) /* sb3.1 header (60) + sha256 hash (32) + min cert block (80) + secp256 signature (64) */
#define NBOOT_SB3_CHUNK_SIZE_IN_BYTES         (256u)
#define NBOOT_SB3_BLOCK_HASH256_SIZE_IN_BYTES (32u)
#define NBOOT_SB3_BLOCK_HASH384_SIZE_IN_BYTES (48u)

/*!
 * @brief NBOOT type for a timestamp
 *
 * This type defines the NBOOT timestamp
 *
 */
typedef uint32_t nboot_timestamp_t[2];

/*!
 * @brief NBOOT SB3.1 header type
 *
 * This type defines the header used in the SB3.1 manifest
 *
 */
typedef struct _nboot_sb3_header
{
    uint32_t magic;         /*!< offset 0x00: Fixed 4-byte string of 'sbv3' without the trailing NULL */
    uint32_t formatVersion; /*!< offset 0x04: (major = 3, minor = 1); The format version determines the manifest
                               (block0) size. */
    uint32_t flags;         /*!< offset 0x08: not defined yet, keep zero for future compatibility */
    uint32_t blockCount;    /*!< offset 0x0C: Number of blocks not including the manifest (block0). */
    uint32_t
        blockSize; /*!< offset 0x10: Size in bytes of data block (repeated blockCount times for SB3 data stream). */
    nboot_timestamp_t timeStamp;     /*!< offset 0x14: 64-bit value used as key derivation data. */
    uint32_t firmwareVersion;        /*!< offset 0x1c: Version number of the included firmware */
    uint32_t imageTotalLength;       /*!< offset 0x20: Total manifest length in bytes, including signatures etc. */
    uint32_t imageType;              /*!< offset 0x24: image type and flags */
    uint32_t certificateBlockOffset; /*!< offset 0x28: Offset from start of header block to the certificate block. */
    uint8_t description[16];         /*!< offset 0x32: This field provides description of the file. It is an arbitrary
                                                      string injected by the signing tool, which helps to identify the file. */
} nboot_sb3_header_t;

#define NBOOT_SB3_MANIFEST_MAX_SIZE_IN_BYTES                                                                  \
    (sizeof(nboot_sb3_header_t) + NBOOT_SB3_BLOCK_HASH384_SIZE_IN_BYTES + sizeof(nboot_certificate_block_t) + \
     NBOOT_EC_COORDINATE_MAX_SIZE * 2)
#define NBOOT_SB3_BLOCK_MAX_SIZE_IN_BYTES \
    (4 /* blockNumber */ + NBOOT_SB3_BLOCK_HASH384_SIZE_IN_BYTES + NBOOT_SB3_CHUNK_SIZE_IN_BYTES)

/*! @brief The size of the blob with Key Blob. */
#define NBOOT_KEY_BLOB_SIZE_IN_BYTE_256 (32U)
#define NBOOT_KEY_BLOB_SIZE_IN_BYTE_384 (48U)
#define NBOOT_KEY_BLOB_SIZE_IN_BYTE_MAX (NBOOT_KEY_BLOB_SIZE_IN_BYTE_384)

#define SB3_DATA_BUFFER_SIZE_IN_BYTE (MAX(128, NBOOT_KEY_BLOB_SIZE_IN_BYTE_MAX))

/*!
 * @brief Boolean type for the NBOOT functions
 *
 * This type defines boolean values used by NBOOT functions that are not easily disturbed by Fault Attacks
 *
 */
typedef enum _nboot_bool
{
    kNBOOT_TRUE                = 0x3C5AC33Cu, /*!< Value for TRUE.  */
    kNBOOT_TRUE256             = 0x3C5AC35Au, /*!< Value for TRUE when P256 was used to sign the image.  */
    kNBOOT_TRUE384             = 0x3C5AC3A5u, /*!< Value for TRUE when P384 was used to sign the image.  */
    kNBOOT_FALSE               = 0x5AA55AA5u, /*!< Value for FALSE. */
    kNBOOT_OperationAllowed    = 0x3c5a33ccU,
    kNBOOT_OperationDisallowed = 0x5aa5cc33U,
} nboot_bool_t;

/*! @brief Data structure holding secure counter value used by nboot library */
typedef struct _nboot_secure_counter
{
    uint32_t sc;
    uint32_t scAp;
} nboot_secure_counter_t;

/** Type for nboot protected status codes */
/** Lower 32-bits holds status value eg. kStatus_NBOOT_Success, upper 32-bits are flow protection value */
typedef uint64_t nboot_status_protected_t;
/** Type for nboot status codes */
typedef uint32_t nboot_status_t;

/**
 * \defgroup nbootStatusValues  This type defines status return values used by NBOOT functions that are not easily
 * disturbed by Fault Attacks
 * @{
 */
#define kStatus_NBOOT_Success                ((nboot_status_t)0x5A5A5A5Au) /*!< Operation completed successfully. */
#define kStatus_NBOOT_Fail                   ((nboot_status_t)0x5A5AA5A5u) /*!< Operation failed. */
#define kStatus_NBOOT_InvalidArgument        ((nboot_status_t)0x5A5AA5F0u) /*!< Invalid argument passed to the function. */
#define kStatus_NBOOT_RequestTimeout         ((nboot_status_t)0x5A5AA5E1u) /*!< Operation timed out. */
#define kStatus_NBOOT_KeyNotLoaded           ((nboot_status_t)0x5A5AA5E2u) /*!< The requested key is not loaded. */
#define kStatus_NBOOT_AuthFail               ((nboot_status_t)0x5A5AA5E4u) /*!< Authentication failed. */
#define kStatus_NBOOT_OperationNotAvaialable ((nboot_status_t)0x5A5AA5E5u) /*!< Operation not available on this HW. */
#define kStatus_NBOOT_KeyNotAvailable        ((nboot_status_t)0x5A5AA5E6u) /*!< Key is not avaialble. */
#define kStatus_NBOOT_IvCounterOverflow      ((nboot_status_t)0x5A5AA5E7u) /*!< Overflow of IV counter (PRINCE/IPED). */
#define kStatus_NBOOT_SelftestFail           ((nboot_status_t)0x5A5AA5E8u) /*!< FIPS self-test failure. */
#define kStatus_NBOOT_InvalidDataFormat      ((nboot_status_t)0x5A5AA5E9u) /*!< Invalid data format for example antipole */
#define kStatus_NBOOT_IskCertUserDataTooBig \
    ((nboot_status_t)0x5A5AA5EAu) /*!< Size of User data in ISK certificate is greater than 96 bytes */
#define kStatus_NBOOT_IskCertSignatureOffsetTooSmall \
    ((nboot_status_t)0x5A5AA5EBu) /*!< Signature offset in ISK certificate is smaller than expected */
#define kStatus_NBOOT_MemcpyFail ((nboot_status_t)0x5A5A845A) /*!< Unexpected error detected during nboot_memcpy() */

/**@}*/

typedef uint32_t nboot_root_key_revocation_t;
typedef uint32_t nboot_root_key_usage_t;
typedef uint32_t nboot_root_key_type_and_length_t;

/*! @brief Enumeration for SoC Lifecycle. */
#define nboot_lc_nxpBlank       (0xFFFF0000u)
#define nboot_lc_nxpFab         (0xFFFE0001u)
#define nboot_lc_nxpDev         (0xFF0300FCu)
#define nboot_lc_nxpProvisioned (0xFFFC0003u)
#define nboot_lc_oemOpen        (0xFFFC0003u)
#define nboot_lc_oemSecureWorld (0xFFF80007u)
#define nboot_lc_oemClosed      (0xFFF0000Fu)
#define nboot_lc_oemLocked      (0xFF3000CFu)
#define nboot_lc_oemFieldReturn (0xFFE0001Fu)
#define nboot_lc_nxpFieldReturn (0xFF80007Fu)
#define nboot_lc_shredded       (0xFF0000FFu)
typedef uint32_t nboot_soc_lifecycle_t;

